<template>
    <div id="app">
        <div class="container container-behind-nav">
            <div class="page-header">
                <h1>Экспорт отрывков с Kindle</h1>
                <p class="">Электронные книги Kindle с подключением к Интернету 
                    позволяют делиться отрывками через социальные сети. 
                    Эта возможность используется для
                    добавления цитат на сайт прямо с устройства, в том числе
                    и из пиратских книг.</p>
                <p class="">Эта инструкция поможет настроить экспорт отрывков через Twitter.</p>
            </div>
            <div>
                <h4>1. Зарегистрируйтесь в Twitter</h4>
                <p>Зарегистрируйте Twitter-аккаунт, в который Kindle мог бы отправлять отрывки. 
                    Не используйте для экспорта свой основной аккаунт чтобы не засорять
                    ленту ваших подписчиков.</p>
                <br>
                <h4>2. Подключите свой Twitter к электронной книге</h4>
                <p>В настройках Kindle перейдите раздел параметров учетной записи. 
                    В пункте "Социальные сети" выберите Twitter и войдите в свой аккаунт.</p>
                <br>
                <h4>3. Подключите свой Twitter к Просто цитатнику</h4>
                <p>Перейдите в <router-link :to="{name: 'Profile'}">Параметры профиля</router-link>.
                    В пункте "Экспорт через Twitter" нажмите на иконку Twitter'a и войдите в свой аккаунт.
                </p>
                <br>
                <h4>4. Укажите книгу для экспорта</h4>
                <p>Kindle не указывает название книги при отправке отрывка в Twitter, 
                    если она не лицензионная. Поэтому на сайте нужно указать в какую книгу
                    добавлять отрывки из Twitter. Для этого перейдите на страницу книги,
                    нажмите на значок <span aria-hidden="true" class="icon-cog"></span> 
                    и выберите "Экспорт из Twitter".</p>
                <br>
                <h4>5. Готово!</h4>
                <p>Все готово для добавления новых цитат. Для того чтобы отправить отрывок 
                    на сайт прямо с
                    Kindle нажмите кнопку "Поделиться" на выделенном отрывке, 
                    выберите "Twitter" и в
                    сообщении упомяните нашего бота - <code>@pcitat</code>
                </p>
                <p>Цитата будет добавлена к выбранной книге в течении минуты после публикации в Twitter. 
                    После появления цитаты на сайте пост в Twitter можно удалить.
                </p>
            </div>
            <br>
            <div class="embed-responsive embed-responsive-16by9">
                <iframe class="embed-responsive-item" 
                src="https://www.youtube.com/embed/RtsEdrBm-tU?color=white&modestbranding=1&rel=0"></iframe>
            </div>
        </div>
    </div>
</template>
<script>
    export default {
        name: 'app',
        components: {  },
        data() {
            return {
            }
        },
        created() {
            this.$root.$data.activeTab = -1
        }
    }

</script>