<template>
    <div id="app">
        <div class="container container-behind-nav">
            <div class="page-header">
                <h1>Договор конфиденциальности</h1>
                <p><small>Обновлено 23.03.2018</small></p>
            </div>
            <div>
                <h4>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h4>
                <p>1.1 В настоящем Договоре используются следующие термины:</p>
                <div class="container">
                    <p>1.1.1. «Сайт "Просто цитатник" (далее Сайт)» – сервис хранения и обработки отрывков из книг, известный под именем «Просто цитатник» и размещенный в сети Интернет по адресу <router-link to="/">{{ baseUrl }}</router-link>.</p>
                    <p>1.1.2. «Администратор Сайта (далее Администратор)» – лицо, определяющее порядок использования Сайта в сети Интернет, организующее и осуществляющее обработку персональных данных, а также определяющее цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия или операции, совершаемые с персональными данными.</p>
                    <p>1.1.3. «Персональные данные» – любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных).</p>
                    <p>1.1.4. «Обработка персональных данных» – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</p>
                    <p>1.1.5. «Конфиденциальность персональных данных» – обязательное для соблюдения Администратором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.</p>
                    <p>1.1.6. «Пользователь» – лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт.</p>
                    <p>1.1.7. «Файл Cookie» – небольшой фрагмент данных, отправленный веб-сервером или создаваемый веб-приложением и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.</p>
                    <p>1.1.8. «IP-адрес» – уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.</p>
                </div>
                <br>
                <h4>2. ОБЩИЕ ПОЛОЖЕНИЯ</h4>
                <p>2.1. Данный Договор является договором присоединения. Использование Пользователем Сайта свидетельствует о присоединении Пользователя к данном договору в полной мере и подтверждает его согласие со всеми приведенными ниже условиями.</p>
                <p>2.2. Во время использования Пользователем Сайта собирается следующая информация:</p>
                <div class="container">
                    <p>2.2.1. данные, которые предоставляются Пользователем при заполнении форм на Сайте и в процессе использования Сайта;</p>
                    <p>2.2.2. файлы Cookie;</p>
                    <p>2.2.3. IP-адрес Пользователя.</p>
                </div>
                <p>2.3. Администратор включает данные Пользователя в базу персональных данных интернет-пользователей с момента, когда Пользователь зарегистрировался на Сайте. Срок хранения данных составляет период, на протяжении которого Пользователь использует Сайт.</p>
                <p>2.4. Администратор выполняет обработку персональных данных Пользователя любыми способами с целью должного предоставления пользователю услуг Сайта.</p>
                <p>2.5. Администратор использует анонимные данные для проведения статистических исследований.</p>
                <p>2.6. Во время использования Пользователем Сайта на страницах Сайта могут присутствовать коды интернет-ресурсов третьих лиц, в результате чего такие третьи лица самостоятельно получают данные, обозначенные в пунктах 2.2, 2.3, 2.5 данного договора. Такими интернет-ресурсами третьих лиц являются:</p>
                <div class="container">
                    <p>2.6.1. системы сбора статистики использования Сайта;</p>
                    <p>2.6.2. плагины социальных сетей, в том числе страницы авторизации.</p>
                </div>
                <p>2.7. Пользователь имеет все права по защите его персональных данных, которые предусмотрены действующим законодательством Украины, в том числе Законом Украины «Про захист персональних даних».</p>
                <p>2.8. Администратор имеет право изменять условия данного Договора в одностороннем порядке. В этом случае все изменения будут опубликованы по адресу <router-link :to="{ name: 'Privacy'}">{{ privacyUrl }}</router-link> и будут обязательными для Пользователя через 10 дней с момента публикации.</p>
            </div>
        </div>
    </div>
</template>
<script>
    export default {
        name: 'app',
        components: {  },
        data() {
            return {
                baseUrl: process.env.BASE_URL
            }
        },
        computed: {
            privacyUrl() {
                return this.baseUrl + this.$router.resolve({name: "Privacy"}).href
            }
        },
        mounted() {
            this.$root.$data.activeTab = -1
        }
    }

</script>