<template>
    <div id="app">
        <div class="container container-behind-nav">
            <div class="page-header">
                <h1>Договор об использовании</h1>
                <p><small>Обновлено 23.03.2018</small></p>
            </div>
            <div>
                <h4>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h4>
                <p>1.1 В настоящем Договоре используются следующие термины:</p>
                <div class="container">
                    <p>1.1.1. «Сайт "Просто цитатник" (далее Сайт)» – сервис хранения и обработки отрывков из книг, известный под именем «Просто цитатник» и размещенный в сети Интернет по адресу <router-link to="/">{{ baseUrl }}</router-link>.</p>
                    <p>1.1.2. «Администратор Сайта (далее Администратор)» – лицо, определяющее порядок использования Сайта в сети Интернет, организующее и осуществляющее обработку персональных данных, а также определяющее цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия или операции, совершаемые с персональными данными.</p>
                    <p>1.1.3. «Пользователь» – лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт.</p>
                </div>
                <br>
                <h4>2. ПРЕДМЕТ ДОГОВОРА</h4>
                <p>2.1. Данный Договор является договором присоединения. Использование Пользователем Сайта свидетельствует о присоединении Пользователя к данном договору в полной мере и подтверждает его согласие со всеми приведенными ниже условиями.</p>
                <p>2.2. Услугами Сайта являются:</p>
                <div class="container">
                    <p>2.2.1. создание и редактирование персональной учетной записи;</p>
                    <p>2.2.2. добавление, редактирование, поиск записей о книгах;</p>
                    <p>2.2.3. добавление и редактирование отрывков из книг;</p>
                    <p>2.2.4. настройка автоматического экспорта отрывков с электронных устройств чтения Amazon Kindle на Сайт через социальную сеть Twitter.</p>
                </div>
                <br>
                <h4>3. ПОРЯДОК ЗАКЛЮЧЕНИЯ ДОГОВОРА</h4>
                <p>3.1. Договор заключается только путем присоединения к нему Пользователя в целом.</p>
                <p>3.2. Факт присоединения Пользователя к данному Договору в целом подтверждается выполнением Пользователем одного из действий, описанных в подпунктах 2.2.1-2.2.4 данного Договора.</p>
                <p>3.3. Договор действует с момента его заключения и до момента разрыва сторонами.</p>
                <br>
                <h4>4. ПОРЯДОК ПРЕДОСТАВЛЕНИЯ УСЛУГ</h4>
                <p>4.1. Пользователь с помощью клиентского приложения Сайта самостоятельно получает услуги Сайта исполняя действия, указанные в подпунктах 2.2.1-2.2.4 данного Договора.</p>
                <p>4.2. Пользователь понимает и соглашается с тем, что Администратор не несет ответственности за технические сбои в предоставлении услуг Сайта, за сохранность информации на Сайте или ее потерю.</p>
                <br>
                <h4>5. ПРЕДОСТЕРЕЖЕНИЯ И ГАРАНТИИ</h4>
                <p>5.1. Администратор не несет ответственности за корректность данных о книгах, полученных с ресурсов третьей стороны.</p>
                <br>
                <h4>6. ПРОЧИЕ УСЛОВИЯ</h4>
                <p>6.1. Спорные вопросы, связанные с выполнением данного Договора, решаются путем переговоров между Пользователем и Администратором.</p>
                <p>6.2. Администратор имеет право изменять условия данного Договора в одностороннем порядке. В этом случае все изменения будут опубликованы по адресу <router-link :to="{ name: 'Terms'}">{{ termsUrl }}</router-link>.</p>
            </div>
        </div>
    </div>
</template>
<script>
    export default {
        name: 'app',
        components: {  },
        data() {
            return {
                baseUrl: process.env.BASE_URL
            }
        },
        computed: {
            termsUrl() {
                return this.baseUrl + this.$router.resolve({name: "Terms"}).href
            }
        },
        mounted() {
            this.$root.$data.activeTab = -1
        }
    }

</script>